_protected/modules/laporan/controllers/PelaporanunitController.php

SELECT * FROM `ppud` WHERE tetap_tanggal >= "2017-01-01" AND tetap_tanggal <= "2017-12-31"
---
    public function actionIndex()
    {
        $Tahun = date('Y');
        $get = new \app\models\Laporan();
        $Kd_Laporan = NULL;
        $data = NULL;
        $data1 = NULL;
        $data2 = NULL;
        $data3 = NULL;
        $data4 = NULL;
        $data5 = NULL;
        $data6 = NULL;
        $render = NULL;
        $getparam = NULL;
        IF(Yii::$app->request->queryParams){
            $getparam = Yii::$app->request->queryParams;
            IF($getparam['Laporan']['Kd_Laporan']){
                $Kd_Laporan = Yii::$app->request->queryParams['Laporan']['Kd_Laporan'];
                switch ($Kd_Laporan) {
                    case 1:
                        $query = \app\models\Tpeserta::find();

                        $data = new ActiveDataProvider([
                            'query' => $query,
                        ]);
                        IF($getparam['Laporan']['kode_pegawai']){
                            $data->query->andWhere(['pegawai_id' => $getparam['Laporan']['kode_pegawai']]);
                        }
                        IF($getparam['Laporan']['Tgl_1']){
                            $ppm = \app\models\Ppud::find()->andWhere('tetap_tanggal >= "'.$getparam['Laporan']['Tgl_1'].'" AND tetap_tanggal <= "'.$getparam['Laporan']['Tgl_2'].'"')->all();

SELECT * FROM `ppud` WHERE tetap_tanggal >= "2017-01-01" AND tetap_tanggal <= "2017-12-31"
---
    public function actionCetak()
    {
        $get = new \app\models\Laporan();
        $Kd_Laporan = NULL;
        $data = NULL;
        $data1 = NULL;
        $data2 = NULL;
        $data3 = NULL;
        $data4 = NULL;
        $data5 = NULL;
        $data6 = NULL;
        $render = NULL;
        $getparam = NULL;
        IF(Yii::$app->request->queryParams){
            $getparam = Yii::$app->request->queryParams;
            IF($getparam['Laporan']['Kd_Laporan']){
                $Kd_Laporan = Yii::$app->request->queryParams['Laporan']['Kd_Laporan'];
                switch ($Kd_Laporan) {
                    case 1:
                        $data1 = \app\models\Pegawai::findOne(['niplama' => $getparam['Laporan']['kode_pegawai']]);
                        if(isset(Yii::$app->user->identity->kode_unit)) $data2 = \app\models\RefUnitOrganisasi::findOne(['kode_unit' => Yii::$app->user->identity->kode_unit]);
                        $query = \app\models\Tpeserta::find();
                        IF($getparam['Laporan']['kode_pegawai']){
                            $query->andWhere(['pegawai_id' => $getparam['Laporan']['kode_pegawai']]);
                        }
                        IF($getparam['Laporan']['Tgl_1']){
                            $ppm = \app\models\Ppud::find()->andWhere('tetap_tanggal >= "'.$getparam['Laporan']['Tgl_1'].'" AND tetap_tanggal <= "'.$getparam['Laporan']['Tgl_2'].'"')->all();